In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kdheee\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\kdheee\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\kdheee\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\users\kdheee\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\users\kdheee\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
type(df)

In [6]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
dummy = {'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]}

In [10]:
df2 = pd.DataFrame(dummy)
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

*List를 이용한 데이터 프레임 생성

In [11]:
a = [[1,2,3], [4,5,6], [7,8,9]]

In [12]:
df3 = pd.DataFrame(a)
df3

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
df3.columns = ['a','b','c'] #컬럼 지정 메서드
df3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
sample = {'company': ['abc', '회사', 123], '직원수': [400, 10, 6]}
df4 = pd.DataFrame(sample)
df4

  company  직원수
0     abc  400
1      회사   10
2     123    6

In [16]:
!pip install numpy
import numpy as np
sample2 = {'company': ['abc', '회사', 123], '직원수': [400,10,6], '위치': ['Seoul', np.nan ,'Busan']}
df5 = pd.DataFrame(sample2)
df5

Requirement already satisfied: numpy in c:\users\kdheee\anaconda3\lib\site-packages (1.20.3)

  company  직원수     위치
0     abc  400  Seoul
1      회사   10    NaN
2     123    6  Busan

# 컬럼명 추출/변경

In [17]:
import pandas as pd

df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [18]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [19]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [22]:
df.columns[1]

'b'

In [24]:
df.columns = ['d', 'e', 'f'] #컬럼 재지정, 필드가 적을 때 유용

In [25]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

* rename을 통한 칼럼명 변경

In [35]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [36]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [39]:
df.rename(columns={'a' : '에이', 'c': '씨'}, inplace=True) #inplace는 변경사항을 저장하는 매서드

In [40]:
df

   에이  b  씨
0   1  4  7
1   2  5  8
2   3  6  9

## Copy를 통한 데이터 복사

* 데이터 생성

In [1]:
import pandas as pd
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [2]:
df2 = df

In [3]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [4]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [5]:
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [6]:
df2 #df랑 같이 컬럼명이 변경 됨

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

* copy를 통한 데이터 복제
  '# Deepcopy

In [7]:
import copy

In [8]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})
df2 = copy.deepcopy(df)

In [9]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [12]:
df2 #출력 결과 df를 따라가지 않는 것을 확인할 수 있음

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

# 시리즈

In [13]:
import pandas as pd

df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [14]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [15]:
type(df['a']) #Series는 대괄호를 통해 호출할 수 있음

pandas.core.series.Series

* Series 생성

In [16]:
a = pd.Series([1, 2, 3, 1, 2, 3])
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

* index 변경

In [18]:
a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f']) #Series의 데이터 갯수와 인덱스 갯수는 같아야 함
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

* 유일한 값 찾기

In [19]:
df = pd.DataFrame({'a' : [1,2,3,1,2,3], 'b' : [4,5,6,6,7,8], 'c' : [7,8,9,10,11,12]})

In [21]:
a = df['a']
a

0    1
1    2
2    3
3    1
4    2
5    3
Name: a, dtype: int64

In [22]:
a.unique()

array([1, 2, 3], dtype=int64)

In [23]:
df['a', 'b'] # Series는 하나씩만 호출 가능함

KeyError: ('a', 'b')

# loc과 iloc을 이용한 원하는 위치의 데이터 추출

In [24]:
import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11,21)], 'c' : [i for i in range(21,31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [25]:
df[['a', 'b']] #Series 형태로는 한 번에 뽑지 못하여, DF 형태로 뽑으면 됨

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

* 첫 번째 행 추출

In [26]:
df.loc[0]

a     1
b    11
c    21
Name: 0, dtype: int64

* 슬라이스로 추출

In [27]:
df.loc[2:4]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

* 인덱스가 문자로 이루어진 데이터 프레임 생성

In [28]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']

In [29]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11,21)], 'c' : [i for i in range(21,31)]}, 
                  index = index) #index 지정
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [31]:
df.loc[0] #index가 문자열로 지정되어 있기 때문에 error 발생

KeyError: 0

In [33]:
df.loc['g']

   a   b   c
g  7  17  27
g  8  18  28

In [34]:
df.loc[['g', 'i'], ['a', 'c']]

    a   c
g   7  27
g   8  28
i  10  30

* iloc을 통해 행, 열 위치에 따른 데이터 추출

In [35]:
df.iloc[:5, [0,2]] #5행까지 0, 2 위치에 있는 열 추출

   a   c
a  1  21
b  2  22
c  3  23
d  4  24
e  5  25

# 조건에 맞는 데이터 추출

In [36]:
import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11,21)], 'c' : [i for i in range(21,31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

* a, c열 출력

In [37]:
df[['a', 'c']]

    a   c
0   1  21
1   2  22
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

* a행의 데이터가 3이상인 데이터 출력

In [39]:
df[df['a']>=3]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

* a행의 데이터가 3이상이면서 a, c열만 추출

In [40]:
df[df['a']>=3][['a','c']]

    a   c
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

* a행의 데이터가 3이상이면서 b가 16미만인 데이터를 추출

In [43]:
df[(df['a']>=3) & (df['b']<16)] # and(&), or(|) 등 조건을 쓸 때는 조건별로 소괄호로 구분

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [44]:
df[(df['a'] <=3) | (df['a'] >= 7)]

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

## 정렬

In [85]:
import pandas as pd

df = pd.DataFrame({'a' : [2, 3, 2, 7, 4], 'b' : [2, 1, 3, 5, 3], 'c' : [1, 1, 2, 3, 5]})
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

* 인덱스(index) 기준 정렬

In [86]:
df.sort_index() # 오름차순이 default 값, ascending=False로 지정하면 내림차순 정리
                # 해당 결과값을 저장하고 싶을 땐 inplace=True로 지정 (False가 default 값)

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

In [87]:
import copy
df2 = copy.deepcopy(df)
df2

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

In [88]:
df2.sort_index(ascending=False, inplace=True)
df2

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

* index 초기화

In [89]:
df2.reset_index(drop=True, inplace=True)
df2

   a  b  c
0  4  3  5
1  7  5  3
2  2  3  2
3  3  1  1
4  2  2  1

* a열 기준으로 오름차순 정렬

In [92]:
df.sort_values(by = ['a'], inplace=True)
df

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [93]:
df.sort_values(by=['a', 'b'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [94]:
df.sort_values(by=['a', 'b'], ascending=[True, False])

   a  b  c
2  2  3  2
0  2  2  1
1  3  1  1
4  4  3  5
3  7  5  3

# 결측값 처리

In [95]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, np.nan, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

* 결측 유무 확인

In [96]:
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False
4  False  False  False

* 결측값 개수 확인

In [97]:
df.isnull().sum() # True는 1처리, False는 0처리

a    0
b    1
c    0
dtype: int64

* 결측값이 포함된 행 지우기

In [99]:
df.dropna(inplace=True)

In [100]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
3  4  3.0  6
4  5  4.0  4

In [101]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, np.nan, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [102]:
df.dropna(axis=1) #axis=1 : 열 기준, axis=0 : 행 기준

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

* 결측값 다른값으로 채우기

In [103]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [104]:
df.fillna(0, inplace=True)

In [105]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  0.0  7
3  4  3.0  6
4  5  4.0  4

* 앞이나 뒤의 숫자로 바꾸기

In [106]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, np.nan], 'b' : [2, 3, np.nan, np.nan, 4], 'c' : [np.nan, 4, 1, 1, 4]})
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  1.0
3  4.0  NaN  1.0
4  NaN  4.0  4.0

 1) 뒤의 값으로 채우기

In [107]:
df.fillna(method='bfill')

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  1.0
3  4.0  4.0  1.0
4  NaN  4.0  4.0

2) 앞의 값으로 채우기

In [108]:
df.fillna(method='ffill')

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  1.0
3  4.0  3.0  1.0
4  4.0  4.0  4.0

In [109]:
df.fillna(method='ffill', limit = 1)

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  1.0
3  4.0  NaN  1.0
4  4.0  4.0  4.0

In [112]:
df.fillna(df.mean()) #각 행의 평균 값으로 채움
                     #특정 행의 평균 값으로 채우기 위해선 df.mean()['column'] 으로 지정

      a    b    c
0  1.00  2.0  2.5
1  1.00  3.0  4.0
2  3.00  3.0  1.0
3  4.00  3.0  1.0
4  2.25  4.0  4.0

# 타입변환

* 데이터 생성

In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5,14/21', '5/15/21'],
                 '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'],
                 '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
df

       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5,14/21  25   23    25
4  5/15/21  30   25  25.4

* 타입 확인

In [8]:
df.dtypes

판매일     object
판매량     object
방문자수    object
기온      object
dtype: object

In [9]:
df['판매량 보정'] = df['판매량'] + 1 #열 생성 방법(기존에 있는 걸로)
                                   # df['판매량']의 dtype이 숫자가 아니라 Error 발생

TypeError: can only concatenate str (not "int") to str

* 타입 변환

In [11]:
df = df.astype({'판매량' : 'int'}) #astype으로 데이터 타입 변환

In [13]:
df.dtypes

판매일     object
판매량      int32
방문자수    object
기온      object
dtype: object

In [14]:
df['판매량 보정'] = df['판매량'] + 1

In [16]:
df

       판매일  판매량 방문자수    기온  판매량 보정
0  5/11/21   10   10  24.1      11
1  5/12/21   15    -  24.3      16
2  5/13/21   20   17  24.8      21
3  5,14/21   25   23    25      26
4  5/15/21   30   25  25.4      31

In [20]:
df['방문자수'] = pd.to_numeric(df['방문자수'], errors='coerce') #pandas to_numeric을 통해 숫자 변형이 가능, errors라는 내부 옵션으로 오류 잡을 수 있음
                                              #error일 때 에러나는 값을 Non값으로 변형해주는 메서드가 coerce 임

In [21]:
df

       판매일  판매량  방문자수    기온  판매량 보정
0  5/11/21   10  10.0  24.1      11
1  5/12/21   15   NaN  24.3      16
2  5/13/21   20  17.0  24.8      21
3  5,14/21   25  23.0    25      26
4  5/15/21   30  25.0  25.4      31

In [22]:
df.fillna(0, inplace=True)

In [23]:
df

       판매일  판매량  방문자수    기온  판매량 보정
0  5/11/21   10  10.0  24.1      11
1  5/12/21   15   0.0  24.3      16
2  5/13/21   20  17.0  24.8      21
3  5,14/21   25  23.0    25      26
4  5/15/21   30  25.0  25.4      31

In [28]:
df = df.astype({'방문자수' : 'int64'})

In [29]:
df

       판매일  판매량  방문자수    기온  판매량 보정
0  5/11/21   10    10  24.1      11
1  5/12/21   15     0  24.3      16
2  5/13/21   20    17  24.8      21
3  5,14/21   25    23    25      26
4  5/15/21   30    25  25.4      31

In [31]:
df.dtypes

판매일       object
판매량        int32
방문자수       int64
기온        object
판매량 보정     int32
dtype: object

*  datetime의 형태로 데이터 변형

In [35]:
df['판매일'][3] = '5/14/21'

C:\Users\kdheee\AppData\Local\Temp/ipykernel_4612/172401455.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['판매일'][3] = '5/14/21'

In [36]:
df['판매일'] = pd.to_datetime(df['판매일'], format = "%m/%d/%y")

In [37]:
df

         판매일  판매량  방문자수    기온  판매량 보정
0 2021-05-11   10    10  24.1      11
1 2021-05-12   15     0  24.3      16
2 2021-05-13   20    17  24.8      21
3 2021-05-14   25    23    25      26
4 2021-05-15   30    25  25.4      31

# 레코드, 칼럼 추가/삭제

In [53]:
import pandas as pd

df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [54]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

* 칼럼 추가

In [55]:
df['d'] = [1, 3, 6, 4, 8]

In [56]:
df

   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8

In [57]:
df['e'] = [1, 1, 1, 1, 1]

In [58]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [59]:
df['e'] = 1 #하나의 값만 넣을 때는 이렇게 지정 가능

In [60]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [61]:
df.dtypes

a    int64
b    int64
c    int64
d    int64
e    int64
dtype: object

In [62]:
df['f'] = df['a'] + df['b'] - df['c'] #숫자 형태면 연산 가능

In [63]:
df

   a  b  c  d  e  f
0  1  2  3  1  1  0
1  1  3  4  3  1  0
2  3  2  7  6  1 -2
3  4  3  6  4  1  1
4  5  4  4  8  1  5

* 컬럼 삭제

In [64]:
df.drop(['d', 'e', 'f'], axis = 1, inplace=True)

In [65]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

* 레코드 추가

In [68]:
df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index=True) #append에는 inplace 없음

In [70]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8

In [71]:
df.loc[6] = [7, 8, 9]
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9